unit04/app/controllers/games_controller.rb

  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("created_at", "genre", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @game.update(game_params)
---
UPDATE "games" SET "price" = ?, "updated_at" = ? WHERE "games"."id" = 1  [["price", #<BigDecimal:7fdc3d4e3bc8,'0.2055E2',18(18)>], ["updated_at", Mon, 02 Feb 2015 22:43:09 UTC +00:00]]

  def destroy
    @game.destroy
---
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 8]]